In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import os

### Extract CSVs into DataFrames

In [21]:
expend_file_path = os.path.join("health_expend_cleaned.csv")

In [22]:
expend_df = pd.read_csv(expend_file_path)
expend_df

      country_id  year       value
0              1  1995         NaN
1              2  1995   13.940591
2              3  1995   46.771460
3              4  1995  897.181541
4              5  1995   13.516833
...          ...   ...         ...
2971         193  2010   31.359855
2972         194  2010   15.269640
2973         195  2010   43.932037
2974         196  2010         NaN
2975         162  2010         NaN

[2976 rows x 3 columns]

In [27]:
expend_df_clean = expend_df.replace(np.nan, '', regex=True)

In [28]:
expend_df_clean

      country_id  year    value
0              1  1995
1              2  1995  13.9406
2              3  1995  46.7715
3              4  1995  897.182
4              5  1995  13.5168
...          ...   ...      ...
2971         193  2010  31.3599
2972         194  2010  15.2696
2973         195  2010   43.932
2974         196  2010
2975         162  2010

[2976 rows x 3 columns]

### Transform premise DataFrame

### Transform county DataFrame

### Create database connection

In [8]:
# Confirm tables

### Load DataFrames into database